cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/cask-versions'

# Editor
cask 'visual-studio-code'

# kubectl lives in Docker App
cask 'docker'

# Kubernetes
tap 'johanhaleby/kubetail'
brew 'kubetail'
brew 'kubectx'
brew 'krew'

# Cloud azure
brew 'azure/draft/draft'
brew 'azure-cli'

# brew 'packer'
cask 'multipass'

# Terraform
brew 'terraform'
brew 'graphviz'
brew 'tflint'

# Microsoft related
cask 'powershell'
cask 'dotnet'
brew 'unix2dos'

# Font related
tap 'homebrew/cask-fonts'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
brew 'highlight'

# QuickLook
# See https://github.com/sindresorhus/quick-look-plugins
cask 'betterzip'
cask 'quicklook-json'

# git tools
brew 'git'
brew 'gitup'
brew 'jamesdobson/gogitmoji/gogitmoji'
brew 'git-secret'
brew 'pre-commit'

# GitHub tools
brew 'hub'
brew 'gitversion'
brew 'git-credential-manager'
brew 'nektos/tap'
brew 'hub'

# dev tools
cask 'visual-studio-code'
brew 'direnv'
brew 'jq'

# dev Node.js
brew 'node'

# dev Ruby
# brew 'rbenv'
# brew 'ruby-build'

# dev Go 
brew 'golang'
brew 'dep'

# miscellaneous tools
brew 'pandoc'
brew 'watch'
brew 'mosh'
brew 'nmap'
brew 'coreutils'
brew 'tree'
brew 'mtr'
brew 'keychain'
brew 'wget'

# more messengers
cask 'slack'
cask 'telegram'

# miscellaneous apps
cask '1password6'
cask 'iterm2'
cask 'dropbox'
cask 'alfred'
cask 'caffeine'
cask 'google-chrome'
cask 'hazel'
cask 'calibre'
cask 'grandperspective'
cask 'moom'

