cask_args appdir: '/Applications'

# Taps
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'

# control external displays
cask 'lunar'

# Docker
cask 'docker'
# kubectl lives in Docker App

# Kubernetes
tap 'johanhaleby/kubetail'
brew 'stern'
brew 'kubectx'
brew 'krew'
brew 'kube-ps1'
brew 'derailed/k9s/k9s'
# brew 'minikube'
# Operator SDK
brew 'operator-sdk'

# Helm
brew 'helm'
brew 'helm@2'
brew 'helmfile'
tap 'helm/tap'
brew 'chart-releaser'

# Cloud azure
# brew 'azure/draft/draft'
# brew 'azure-cli'

# Cloud google
# cask 'google-cloud-sdk'

# Cloud aws
tap 'versent/homebrew-taps'
brew 'saml2aws'
brew 'awscli'
tap 'weaveworks/tap'
brew 'weaveworks/tap/eksctl'
# cask 'aws-vault'

# brew 'packer'
# cask 'multipass'

# Terraform
brew 'terraform'
brew 'terraform-docs'
brew 'graphviz'
brew 'tflint'
brew 'terragrunt'
brew 'tfenv', link: :force
tap 'alextodicescu/tgenv'
brew 'tgenv'

# Microsoft related
# cask 'powershell'
# brew 'unix2dos'

# Font related
tap 'homebrew/cask-fonts'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
brew 'highlight'

# QuickLook
# See https://github.com/sindresorhus/quick-look-plugins
# cask 'betterzip'
# cask 'quicklook-json'

# git tools
brew 'git'
brew 'gitup'
brew 'git-secret'
brew 'pre-commit'

# GitHub tools
brew 'gh'   # GitHub’s official command line tool
brew 'gitversion'
brew 'git-credential-manager'
tap 'nektos/tap'
brew 'nektos/tap/act'

# Editor & Terminal
cask 'visual-studio-code'
cask 'iterm2'

# yaml / json
brew 'jq'
brew 'yq'
brew 'yamllint'
# tap 'starkandwayne/cf'
# brew 'spruce'
# cask 'postman'

# Shell tools
# brew 'fzf'
brew 'direnv'
brew 'shellcheck'

# dev Node.js
# brew 'node'

# dev Ruby
# brew 'rbenv'
# brew 'ruby-build'

# dev Go 
brew 'golang'
brew 'dep'

# dev Kubernetes
brew 'skaffold'

# miscellaneous tools
brew 'dialog'
brew 'pandoc'
brew 'watch'
brew 'mosh'
brew 'nmap'
brew 'coreutils'
brew 'tree'
brew 'mtr'
brew 'keychain'
brew 'wget'
brew 'hugo'
brew 'miniupnpc'

# more messengers ;)
cask 'slack'
cask 'telegram'

# miscellaneous apps
cask 'dropbox'
cask 'alfred'
cask 'caffeine'
cask 'google-chrome'
cask 'hazel'
cask 'calibre'
cask 'grandperspective'
cask 'atext'
cask 'openconnect-gui'
cask '1password-cli'
